app/controllers/session_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'fry@planet-express.com' ORDER BY "users"."id" ASC LIMIT 1
SELECT 1 AS one FROM "users" WHERE ("users"."email" = 'fry@planet-express.com' AND "users"."id" != 135) LIMIT 1
---
  def create
    @user = User.find_by_email(session_params[:email].downcase)
    if @user.present? && @user.confirm_password?(session_params[:password])