app/controllers/user_controller.rb

  def create
    user = User.create(user_params)
    user.password_required!
    if user.save
      log_on_user(user)
      return render json: { success: true }
    end
    render json: {
      success: false,
      message: I18n.t('login.errors', errors: user.errors.full_messages.join("\n"))
---
INSERT INTO "users" ("created_at", "email", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Sun, 01 Sep 2013 13:08:02 UTC +00:00], ["email", "arbitrary_string"], ["updated_at", Sun, 01 Sep 2013 13:08:02 UTC +00:00]]
UPDATE "users" SET "salt" = $1, "password_hash" = $2, "updated_at" = $3 WHERE "users"."id" = 97  [["salt", "6be000b1d602bf7bf5d32c96facdb8c9"], ["password_hash", "571c9c806b496beabd04165b3c7838bdae6c236abc1d6672de23a225002f4bb7"], ["updated_at", Sun, 01 Sep 2013 13:39:15 UTC +00:00]]
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1